backend/app/controllers/api/v1/recipes_controller.rb

  def create
    @recipe = Recipe.find_or_create_by(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE (ingredient_blob ilike '%tomato%')
INSERT INTO "recipes" ("user_id", "title", "ingredient_blob", "directions", "cooking_time", "image_url", "source_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @comment = Comment.create(content: comments_params[:content], recipe: @recipe)
---
INSERT INTO "comments" ("recipe_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 7], ["content", "Still cooking"], ["created_at", "2019-03-28 23:11:42.954797"], ["updated_at", "2019-03-28 23:11:42.954797"]]