backend/app/controllers/api/v1/tags_controller.rb

  def create
    @recipe = Recipe.find(tag_params[:recipe_id])
    RecipeTag.where('recipe_id = ?', @recipe.id).destroy_all

    tag_params[:names].each do |name|
      @tag = Tag.find_or_create_by(name: name)
      RecipeTag.create({tag: @tag, recipe: @recipe})
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "recipe_tags" WHERE "recipe_tags"."id" = $1  [["id", 14]]
SELECT "recipe_tags".* FROM "recipe_tags" WHERE (recipe_id = 7)
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Seafood"], ["created_at", "2019-03-28 16:55:18.056482"], ["updated_at", "2019-03-28 16:55:18.056482"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "Seafood"], ["LIMIT", 1]]
INSERT INTO "recipe_tags" ("recipe_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 7], ["tag_id", 6], ["created_at", "2019-03-28 19:13:28.512666"], ["updated_at", "2019-03-28 19:13:28.512666"]]